README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-11 Sun 14:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>README <code>Deep_sort</code> implementation fork</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Sergio-Feliciano Mendoza-Barrera" />
<meta name="description" content="Deep Learning Specialization series course"
 />
<meta name="keywords" content="R, data science, emacs, ESS, org-mode, deep learning" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">README <code>Deep_sort</code> implementation fork</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1ac8642">1. README</a>
<ul>
<li><a href="#intro">1.1. Intro</a></li>
<li><a href="#dependencies">1.2. Dependencies</a></li>
<li><a href="#getting-started">1.3. Getting started</a></li>
<li><a href="#some-numbers">1.4. Some numbers :</a></li>
<li><a href="#disclamer">1.5. Disclamer :</a></li>
<li><a href="#citation">1.6. Citation</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="ABSTRACT">
<p>
<b>Important:</b> Forked from <a href="https://github.com/bendidi/Tracking-with-darkflow">https://github.com/bendidi/Tracking-with-darkflow</a>
</p>

<p>
The purpose of this little project is to add object tracking to yolov2
and achieve real-time multiple object tracking.
</p>

<p>
The idea is contained on this <a href="file:///home/jaalkab/src/dod/dod_people_tracking/docs/1703.07402.pdf">paper</a>.
</p>

</div>

<div id="outline-container-org1ac8642" class="outline-2">
<h2 id="org1ac8642"><span class="section-number-2">1</span> README</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Important:</b> Forked from <a href="https://github.com/bendidi/Tracking-with-darkflow">https://github.com/bendidi/Tracking-with-darkflow</a>
</p>
</div>

<div id="outline-container-org6c40661" class="outline-3">
<h3 id="intro"><a id="org6c40661"></a><span class="section-number-3">1.1</span> Intro</h3>
<div class="outline-text-3" id="text-intro">
<p>
The purpose of this little project is to add object tracking to YOLOv2
and achieve real-time multiple object tracking.
</p>

<p>
The current architecture is set to only track one type of objects, but
it should be easy to generalise over all objects.
</p>

<p>
Currently support people tracking (as the provided weights for
<code>deep_sort</code> were trained on people tracking)
</p>
</div>
</div>

<div id="outline-container-org1b1a3ee" class="outline-3">
<h3 id="dependencies"><a id="org1b1a3ee"></a><span class="section-number-3">1.2</span> Dependencies</h3>
<div class="outline-text-3" id="text-dependencies">
<pre class="example">
python
numpy
opencv 3
tensorflow 1.0
Cython.
sklean.
</pre>

<p>
for using sort :
</p>

<p>
<a href="http://scikit-learn.org/stable/"><code>scikit-learn</code></a>
<a href="http://scikit-image.org/download"><code>scikit-image</code></a>
<a href="https://github.com/rlabbe/filterpy"><code>FilterPy</code></a>
</p>
</div>

<div id="outline-container-org3ee2e4a" class="outline-4">
<h4 id="setup"><a id="org3ee2e4a"></a><span class="section-number-4">1.2.1</span> Setup</h4>
<div class="outline-text-4" id="text-setup">
<ol class="org-ol">
<li>Clone this repository:
<code>git clone https://github.com/bendidi/Tracking-with-darkflow.git</code></li>

<li>Initialize all submodules:
<code>git submodule update --init --recursive</code></li>

<li>Go to darkflow directory and do in place build:
<code>python3 setup.py build_ext --inplace</code></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgf150d19" class="outline-3">
<h3 id="getting-started"><a id="orgf150d19"></a><span class="section-number-3">1.3</span> Getting started</h3>
<div class="outline-text-3" id="text-getting-started">
<p>
Download the weights :
</p>

<p>
Read more about YOLO (in darknet) and download weight files <a href="http://pjreddie.com/darknet/yolo/">here</a>, in
case the weight file cannot be found, <a href="https://github.com/thtrieu">thtrieu</a> has uploaded some of his
<a href="https://drive.google.com/drive/folders/0B1tW_VtY7onidEwyQ2FtQVplWEU">here</a>, which include <code>yolo-full</code> and <code>yolo-tiny</code> of v1.0,
<code>tiny-yolo-v1.1</code> of v1.1 and <code>yolo</code>, <code>tiny-yolo-voc</code> of v2.
</p>

<p>
The artchitecture I used/tested in this project is <code>cfg/yolo.cfg</code> with
the weights <code>bin/yolo.weights</code>.
</p>

<p>
Next you need to download the <code>deep_sort</code> weights <a href="https://owncloud.uni-koblenz.de/owncloud/s/f9JB0Jr7f3zzqs8?path=/resources">here</a> (networks
folder), provided by <a href="https://github.com/nwojke">nwojke</a> extract the folder and copy it to
<code>deep_sort/resources</code>
</p>

<p>
Edit Flags in <code>run.py</code> following your configuration:
</p>

<ul class="org-ul">
<li><code>demo</code> : path to video file to use, set to "camera" if you wish to
use your camera</li>

<li><code>model</code> : what model configuration to use for YOLO, you can get more
 information and .cfg files in <a href="http://pjreddie.com/darknet/yolo/">here</a>(put them in <code>darkflow/cfg/</code>
folder)</li>

<li><code>load</code> : The corresponding weights to use with the chosen model (put
them in darkflow/bin/) more info in <a href="http://pjreddie.com/darknet/yolo/">here</a></li>

<li><code>threshold</code> : the confidance threshold of the YOLO detections</li>

<li><code>gpu</code> : How much GPU to use, 0 means use cpu</li>

<li><code>track</code> : to activate tracking or not</li>

<li><code>trackObj</code>: which objects to track as a list (notice that
<code>deep_sort</code>'s encoder was only trained on people , so you need train
your own encoder, more information in <a href="https://github.com/nwojke/deep_sort/issues/7">here</a>)</li>

<li><code>saveVideo</code> : whether to save video or not</li>

<li><code>BK_MOG</code> : add opencv's MOG background subtraction module, only
useful when YOLO can't detect people in a video (low quality, &#x2026;)
use it to detect boxes around moving objects</li>

<li><p>
<code>tracker</code> : which tracker to use : "deep_sort" or "sort"
</p>

<pre class="example">
NOTE: "deep_sort" only supports people tracking as it was only trained to track people(the code for training is not yet published)

TODO: add support for GOTURN tracker(tensorflow implementation)

TODO: add support for opencv trackers (MIL,KCF,TLD,MEDIANFLOW)
</pre></li>

<li><code>skip</code>: skip frames to increase fps, might decrease accuracy!</li>

<li><code>csv</code> : save csv file of detections in the format
(<code>frame_id</code>, <code>object_id</code>, <code>x</code>, <code>y</code> ,~w~, <code>h</code>)</li>

<li><code>display</code> : display video while processing or not</li>
</ul>

<p>
Next you just have to run <code>python run.py</code>, and enjoy!
</p>
</div>
</div>

<div id="outline-container-org5cf8152" class="outline-3">
<h3 id="some-numbers"><a id="org5cf8152"></a><span class="section-number-3">1.4</span> Some numbers :</h3>
<div class="outline-text-3" id="text-some-numbers">
<p>
speed using <code>yolo.cfg</code>:
</p>

<pre class="example">
YOLO with track Flag set to False : 30fps
YOLO with track Flag set to True (deep_sort) : 14 fps
YOLO with track and background subtraction Flags set to Ture : 10.5 fps
</pre>

<p>
Tests done on <code>(1024, 1280, 3)</code> resolution video on Nvidia GTX 1080
</p>

<p>
skipping up to 3 frames allows for more speed up while keeping accuracy
of tracking`
</p>
</div>
</div>

<div id="outline-container-org4248ba9" class="outline-3">
<h3 id="disclamer"><a id="org4248ba9"></a><span class="section-number-3">1.5</span> Disclamer :</h3>
<div class="outline-text-3" id="text-disclamer">
<p>
this project is using code forked from:
</p>

<p>
<a href="https://github.com/thtrieu/darkflow">thtrieu/darkflow</a>: for the real-time object detections and
classifications.
</p>

<p>
<a href="https://github.com/nwojke/deep_sort">nwojke/deep_sort</a>: for Simple Online Realtime Tracking with a Deep
Association Metric.
</p>

<p>
Please follow the links to get an understanding of all the features of
each project.
</p>
</div>
</div>

<div id="outline-container-org91570ec" class="outline-3">
<h3 id="citation"><a id="org91570ec"></a><span class="section-number-3">1.6</span> Citation</h3>
<div class="outline-text-3" id="text-citation">
</div>

<div id="outline-container-orgbee2286" class="outline-4">
<h4 id="yolov2"><a id="orgbee2286"></a><span class="section-number-4">1.6.1</span> YOLOv2 :</h4>
<div class="outline-text-4" id="text-yolov2">
<pre class="example">
@article{redmon2016yolo9000,
  title={YOLO9000: Better, Faster, Stronger},
  author={Redmon, Joseph and Farhadi, Ali},
  journal={arXiv preprint arXiv:1612.08242},
  year={2016}
}
</pre>
</div>
</div>

<div id="outline-container-org34c99da" class="outline-4">
<h4 id="deep_sort"><a id="org34c99da"></a><span class="section-number-4">1.6.2</span> <code>deep_sort</code>:</h4>
<div class="outline-text-4" id="text-deep_sort">
<pre class="example">
@article{Wojke2017simple,
  title={Simple Online and Realtime Tracking with a Deep Association Metric},
  author={Wojke, Nicolai and Bewley, Alex and Paulus, Dietrich},
  journal={arXiv preprint arXiv:1703.07402},
  year={2017}
}
</pre>
</div>
</div>

<div id="outline-container-orga037a6b" class="outline-4">
<h4 id="sort"><a id="orga037a6b"></a><span class="section-number-4">1.6.3</span> sort :</h4>
<div class="outline-text-4" id="text-sort">
<pre class="example">
@inproceedings{Bewley2016_sort,
  author={Bewley, Alex and Ge, Zongyuan and Ott, Lionel and Ramos, Fabio and Upcroft, Ben},
  booktitle={2016 IEEE International Conference on Image Processing (ICIP)},
  title={Simple online and realtime tracking},
  year={2016},
  pages={3464-3468},
  keywords={Benchmark testing;Complexity theory;Detectors;Kalman filters;Target tracking;Visualization;Computer Vision;Data Association;Detection;Multiple Object Tracking},
  doi={10.1109/ICIP.2016.7533003}
}
</pre>

<p>
EOF
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 08/03/2018</p>
<p class="author">Author: Sergio-Feliciano Mendoza-Barrera</p>
<p class="date">Created: 2018-03-11 Sun 14:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
